# Pandas

## Series

In [1]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [14]:
ser2 = pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])
ser2['USA']

1

In [15]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrame

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4),['r1','r2','r3','r4','r5'],['c1','c2','c3','c4'])
df

          c1        c2        c3        c4
r1  2.706850  0.628133  0.907969  0.503826
r2  0.651118 -0.319318 -0.848077  0.605965
r3 -2.018168  0.740122  0.528813 -0.589001
r4  0.188695 -0.758872 -0.933237  0.955057
r5  0.190794  1.978757  2.605967  0.683509

In [22]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df['c1']

r1    0.302665
r2   -0.134841
r3    0.807706
r4   -0.497104
r5   -0.116773
Name: c1, dtype: float64

In [23]:
type(df['c1'])

pandas.core.series.Series

_**Note:** Each of the columns in a **DataFrame** are just **Pandas'** Series with shared indicies, i.e. the row indicies._

In [28]:
df[['c1','c2']]

          c1        c2
r1  0.302665  1.693723
r2 -0.134841  0.390528
r3  0.807706  0.072960
r4 -0.497104 -0.754070
r5 -0.116773  1.901755

In [29]:
df['cnew'] = df['c1'] + df['c2']

In [30]:
df

          c1        c2        c3        c4      cnew
r1  0.302665  1.693723 -1.706086 -1.159119  1.996388
r2 -0.134841  0.390528  0.166905  0.184502  0.255687
r3  0.807706  0.072960  0.638787  0.329646  0.880666
r4 -0.497104 -0.754070 -0.943406  0.484752 -1.251174
r5 -0.116773  1.901755  0.238127  1.996652  1.784981

In [32]:
df.drop('cnew',axis=1,inplace=True)

In [33]:
df

          c1        c2        c3        c4
r1  0.302665  1.693723 -1.706086 -1.159119
r2 -0.134841  0.390528  0.166905  0.184502
r3  0.807706  0.072960  0.638787  0.329646
r4 -0.497104 -0.754070 -0.943406  0.484752
r5 -0.116773  1.901755  0.238127  1.996652

In [34]:
df.shape     # (row, column) --> (axis=0, axis=1)

(5, 4)

In [37]:
df.loc['r2']
df.iloc[1]

c1   -0.134841
c2    0.390528
c3    0.166905
c4    0.184502
Name: r2, dtype: float64

In [45]:
df.loc[['r2','r4'],['c2','c3']]
df.iloc[[1,3],[1,2]]

          c2        c3
r2  0.390528  0.166905
r4 -0.754070 -0.943406

### Conditional Statements

In [5]:
df > 0

       c1     c2     c3     c4
r1   True   True   True   True
r2   True  False  False   True
r3  False   True   True  False
r4   True  False  False   True
r5   True   True   True   True

In [6]:
df[df>0]

          c1        c2        c3        c4
r1  2.706850  0.628133  0.907969  0.503826
r2  0.651118       NaN       NaN  0.605965
r3       NaN  0.740122  0.528813       NaN
r4  0.188695       NaN       NaN  0.955057
r5  0.190794  1.978757  2.605967  0.683509

In [7]:
df['c1'] > 0

r1     True
r2     True
r3    False
r4     True
r5     True
Name: c1, dtype: bool

In [8]:
df[df['c1']>0]

          c1        c2        c3        c4
r1  2.706850  0.628133  0.907969  0.503826
r2  0.651118 -0.319318 -0.848077  0.605965
r4  0.188695 -0.758872 -0.933237  0.955057
r5  0.190794  1.978757  2.605967  0.683509

In [13]:
df[df['c1']>0][['c2','c3']]

          c2        c3
r1  0.628133  0.907969
r2 -0.319318 -0.848077
r4 -0.758872 -0.933237
r5  1.978757  2.605967

In [19]:
# Explaination of above.
boolSeries = df['c1']>0
result = df[boolSeries]
myCols = ['c2','c3']
result[myCols]

          c2        c3
r1  0.628133  0.907969
r2 -0.319318 -0.848077
r4 -0.758872 -0.933237
r5  1.978757  2.605967

In [24]:
df[(df['c1']>0) & (df['c2']>0)]

          c1        c2        c3        c4
r1  2.706850  0.628133  0.907969  0.503826
r5  0.190794  1.978757  2.605967  0.683509

In [25]:
df[(df['c1']>0) | (df['c2']>0)]

          c1        c2        c3        c4
r1  2.706850  0.628133  0.907969  0.503826
r2  0.651118 -0.319318 -0.848077  0.605965
r3 -2.018168  0.740122  0.528813 -0.589001
r4  0.188695 -0.758872 -0.933237  0.955057
r5  0.190794  1.978757  2.605967  0.683509

### Resetting Index

In [26]:
df.reset_index()     # Not inplace

  index        c1        c2        c3        c4
0    r1  2.706850  0.628133  0.907969  0.503826
1    r2  0.651118 -0.319318 -0.848077  0.605965
2    r3 -2.018168  0.740122  0.528813 -0.589001
3    r4  0.188695 -0.758872 -0.933237  0.955057
4    r5  0.190794  1.978757  2.605967  0.683509

In [27]:
newInd = 'CA NY WY OR CO'.split()
newInd

['CA', 'NY', 'WY', 'OR', 'CO']

In [28]:
df['States'] = newInd
df

          c1        c2        c3        c4 States
r1  2.706850  0.628133  0.907969  0.503826     CA
r2  0.651118 -0.319318 -0.848077  0.605965     NY
r3 -2.018168  0.740122  0.528813 -0.589001     WY
r4  0.188695 -0.758872 -0.933237  0.955057     OR
r5  0.190794  1.978757  2.605967  0.683509     CO

In [29]:
df.set_index('States')

              c1        c2        c3        c4
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### Multi-index

In [2]:
# Index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [7]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  0.188695 -0.758872
   2 -0.933237  0.955057
   3  0.190794  1.978757
G2 1  2.605967  0.683509
   2  0.302665  1.693723
   3 -1.706086 -1.159119

In [14]:
df.loc['G1']
df.loc['G1'].loc[1]
df.loc['G1'].loc[1]['A']

0.18869530944922425

In [13]:
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1    0.188695 -0.758872
       2   -0.933237  0.955057
       3    0.190794  1.978757
G2     1    2.605967  0.683509
       2    0.302665  1.693723
       3   -1.706086 -1.159119

In [16]:
df.xs('G1')
df.xs(1,level='Num')

               A         B
Groups
G1      0.188695 -0.758872
G2      2.605967  0.683509

### Missing Data

In [4]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [6]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.dropna(axis=0, thresh=2)     # Threshold equals the number of values in any axis which are not NaN.

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
df.fillna(value='FILL VALUE')
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

### Group By

In [15]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)

In [16]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [19]:
byComp = df.groupby('Company')
byComp

In [22]:
byComp.std()
byComp.mean()
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [21]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [24]:
byComp.min()     # min() is working on Person column not Sales

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [25]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

### Concatenating

In [37]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
},
index=[0, 1, 2, 3])

In [29]:
df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']
},
index=[4, 5, 6, 7])

In [30]:
df3 = pd.DataFrame({
    'A': ['A8', 'A9', 'A10', 'A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C': ['C8', 'C9', 'C10', 'C11'],
    'D': ['D8', 'D9', 'D10', 'D11']
},
index=[8, 9, 10, 11])

In [36]:
df1

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [38]:
pd.concat([df1,df2,df3])
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging

In [42]:
left = pd.DataFrame({
    'key1': ['K0', 'K0', 'K1', 'K2'],
    'key2': ['K0', 'K1', 'K0', 'K1'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})

right = pd.DataFrame({
    'key1': ['K0', 'K1', 'K1', 'K2'],
    'key2': ['K0', 'K0', 'K0', 'K0'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

In [43]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [47]:
# INNER JOIN

# Single Key
# pd.merge(left, right, how='inner', on='key')

# Multiple Key
pd.merge(left, right, on=['key1', 'key2'])     # Inner Join is the default join.

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [49]:
# OUTER JOIN
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [50]:
# LEFT JOIN
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### Joining

In [51]:
left = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
},
index=['K0', 'K1', 'K2'])

right = pd.DataFrame({
    'C': ['C0', 'C2', 'C3'],
    'D': ['D0', 'D2', 'D3']
},
index=['K0', 'K2', 'K3'])

In [52]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [58]:
left.join(right)     # Left Join is the default join.
left.join(right, how='inner')
left.join(right, how='outer')
left.join(right, how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

### Operations

In [4]:
df = pd.DataFrame({
    'col1': [1, 2, 3, 4],
    'col2': [444, 555, 666, 444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [14]:
df['col2'].unique()
df['col2'].nunique()

3

In [13]:
df[(1<df['col1']) & (df['col1']<4)]

   col1  col2 col3
1     2   555  def
2     3   666  ghi

In [15]:
def times2(x):
    return x*2

In [17]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [16]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [18]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [21]:
df.columns
df.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
df.sort_values(by=['col2', 'col3'])

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [25]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### Pivot Table

In [28]:
data = {
    'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x', 'y', 'x', 'y', 'x', 'y'],
    'D': [1, 3, 2, 5, 4, 1]
}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [30]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Data Input & Output

Data Sources:
* CSV
* Excel
* HTML
* SQL

Libraries:
* sqlalchemy
* lxml
* html5lib
* BeautifulSoup4

In [4]:
pwd

'C:\\Users\\soura\\Documents\\Python'

In [5]:
df = pd.read_csv('workbook/example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
df.to_csv('my_output', index=False)     # "index=False" doesn't save index into the csv.
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [12]:
data[0].head()     # 'data' is a list of all the tables that pandas found in the html file.

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund
0,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540

### SQL

_Note: It's better to find a specific SQL library dedicated to your required SQL engine than using generic SQL libraries._

In [14]:
from sqlalchemy import create_engine

In [15]:
engine = create_engine('sqlite:///:memory:')

In [16]:
df.to_sql('my_table', engine)

4

In [17]:
sqldf = pd.read_sql('my_table', con=engine)

AttributeError: 'OptionEngine' object has no attribute 'execute'